app/controllers/stocks_controller.rb

  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save
---
INSERT INTO "stocks" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @stock.update(stock_params)
---
UPDATE "stocks" SET "description" = ?, "image_url" = ?, "price" = ?, "title" = ?, "updated_at" = ? WHERE "stocks"."id" = 980190962  [["description", "Wibbles are fun!"], ["image_url", "lorem.jpg"], ["price", "$30.12"], ["title", "Lorem Ipsum"], ["updated_at", "2014-07-24 20:50:41.339630"]]

  def destroy
    @stock.destroy
---
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 3]]

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks"  WHERE "stocks"."id" = ? LIMIT 1  [["id", 3]]