app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.balance = 500
    @user.stock = "|RSI16" + params.to_s

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("balance", "created_at", "name", "password_digest", "stock", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["balance", 0.0], ["created_at", "2014-07-27 15:16:14.240091"], ["name", "burzoman"], ["password_digest", "samanye"], ["stock", "RSI16"], ["updated_at", "2014-07-27 15:16:14.240091"]]